WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(mdwCfgTimerChan->timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Couldn't get TimerInfo via timer number:%lu\n",
          __FILE__, __LINE__, mdwCfgTimerChan->timerNumber);
    return MEADOW_MEAS_FREQ_UNCFG_TIMER_ACCESS_NULL;
  }

  uint32_t timerBase = mdwFreqTimerInfo->timerBase;

  // Stop the timer clock so values can be written to registers
  uint32_t apbClock = meadow_measure_freq_get_apb_clock(mdwFreqTimerInfo);
  modifyreg32(apbClock, mdwFreqTimerInfo->timerClkEn, 0);

  // Is the channel configured?
  uint8_t channelBit = meadow_measure_freq_get_chan_bit_set(
          mdwCfgTimerChan->channelNumber);
  if((mdwFreqTimerInfo->chanActiveBits & channelBit) == 0)
  {
    syslog(1, "%s@%d-Rqst unconfigure, channel not configured\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_UNCFG_CHAN_NOT_CONFIG;
  }

  mdwFreqChanData_t *mdwFreqChanData =
            mdwFreqTimerInfo->mdwFreqChanData[channelOffset];
  if(mdwFreqChanData == NULL)
  {
    syslog(1, "%s@%d-Channel data NULL\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_UNCFG_NO_CHANNEL;
  }

  // Unconfigure channel hardware
  ccerRegVal = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  dierRegVal = getreg16(timerBase + STM32_GTIM_DIER_OFFSET);
  channelBit = mdwFreqTimerInfo->chanActiveBits;

  // Modify the desired channel
  switch(mdwCfgTimerChan->channelNumber)
  {
    case FREQ_CHANNEL_NUMBER_CHAN_1:
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
      regVal32 &= ~(GTIM_CCMR1_CC1S_MASK);
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

      channelBit &= ~ACTIVE_CHAN_BITFIELD_1;  // Clear channel field
      // Reset Capture/Compare Enable Register
      ccerRegVal &= ~(GTIM_CCER_CC1E | GTIM_CCER_CC1P | GTIM_CCER_CC1NP);
      dierRegVal &= ~GTIM_DIER_CC1IE;         // DMA/Interrupt disable
      break;

    case FREQ_CHANNEL_NUMBER_CHAN_2:
      // Capture/compare mode reg 1, chan 2
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
      regVal32 &= ~(GTIM_CCMR1_CC2S_MASK);
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

      channelBit &= ~ACTIVE_CHAN_BITFIELD_2;
      ccerRegVal &= ~(GTIM_CCER_CC2E | GTIM_CCER_CC2P | GTIM_CCER_CC2NP);
      dierRegVal &= ~GTIM_DIER_CC2IE;
      break;

    case FREQ_CHANNEL_NUMBER_CHAN_3:
      // Capture/compare mode reg 2, chan 3
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET);
      regVal32 &= ~(GTIM_CCMR2_CC3S_MASK);
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR2_OFFSET);

      channelBit &= ~ACTIVE_CHAN_BITFIELD_3;
      ccerRegVal &= ~(GTIM_CCER_CC3E | GTIM_CCER_CC3P | GTIM_CCER_CC3NP);
      dierRegVal &= ~GTIM_DIER_CC3IE;
      break;

    case FREQ_CHANNEL_NUMBER_CHAN_4:
      // Capture/compare mode reg 2, chan 4
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET);
      regVal32 &= ~(GTIM_CCMR2_CC4S_MASK);
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR2_OFFSET);

      channelBit &= ~ACTIVE_CHAN_BITFIELD_4;
      ccerRegVal &= ~(GTIM_CCER_CC4E | GTIM_CCER_CC4P | GTIM_CCER_CC2NP);
      dierRegVal &= ~GTIM_DIER_CC4IE;
      break;
  }

  // Save the new values
  putreg16(ccerRegVal, timerBase + STM32_GTIM_CCER_OFFSET);
  putreg16(dierRegVal, timerBase + STM32_GTIM_DIER_OFFSET);

  mdwFreqTimerInfo->chanActiveBits = channelBit;

  // Unconfigure GPIO
  stm32_unconfiggpio(mdwFreqChanData->inputConfig);

  // If there are no active channels, unconfigure the timer itself
  if(channelBit == 0)
  {
    syslog(1, "-->%s@%d-Need to remove Timer, active channels:0x%02x (MUST BE 0x00)\n",
              __FILE__, __LINE__, mdwFreqTimerInfo->chanActiveBits);

    // Stop interrupts
    up_disable_irq(mdwFreqTimerInfo->timerIrqVec);

    // Since no remaining channels, stop calling the ISR for overflows
    dierRegVal &= ~GTIM_DIER_UIE;
    putreg16(dierRegVal, timerBase + STM32_GTIM_DIER_OFFSET);

    // No need to auto-reload CNT
    uint16_t regval = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
    regval &= ~GTIM_CR1_ARPE;    // Auto Reload Pre-Load enable bit
    putreg16(regval, timerBase + STM32_GTIM_CR1_OFFSET);

    // Detach ISR
    ret = irq_detach(mdwFreqTimerInfo->timerIrqVec);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-irq_detach failed, ret:%d, errno:%d\n",
            __FILE__, __LINE__, ret, errno);
      return MEADOW_MEAS_FREQ_UNCFG_IRQ_DETACH_ERR;
    }

    // Disable timer
    meadow_measure_freq_disable(mdwFreqTimerInfo->timerBase);

    // Clear the only modifiable timer fields
    mdwFreqTimerInfo->timerOverflow  = 0;
    mdwFreqTimerInfo->chanActiveBits = 0;
  }
  else
  {
    // Still active channels
    // Restart the timer clock
    uint32_t apbClock = meadow_measure_freq_get_apb_clock(mdwFreqTimerInfo);
    modifyreg32(apbClock, 0, mdwFreqTimerInfo->timerClkEn);
  }

  // Free channel runtime memory
  free(mdwFreqChanData);
  mdwFreqChanData = NULL;

  return MEADOW_MEAS_FREQ_UNCFG_SUCCESSFUL;
}

//================================================================
// Return Frequency and Duty Cycle information to caller.
// Moved as much processing here as apposed to the ISR.
int meadow_measure_freq_return_freq_info(mdwFreqReturnData_t *returnData)
{
  // 64 bytes of stack space
  double dblFrequency;
  double dblDutyCycle;
  double dblTotalInputCount;
  double dblAvgFreq;
  uint64_t halfCycle;
  uint64_t fullCycle;
  uint64_t regOvrFloTimSize;
  uint64_t bgnCapture;
  uint64_t midCapture;
  uint64_t endCapture;
  uint64_t totalCaptureTime;
  uint64_t endCaptureTime = meadow_measure_freq_get_current_time();

  // Verify that provided timer and channel are valid
  if(returnData->timerNumber > 14 || returnData->timerNumber < 1)
  {
    syslog(2, "%s@%d-Timer must be 1 - 14\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_INVALID_TIMER_NUMB;
  }

  if(returnData->channelNumber > 4 || returnData->channelNumber < 1)
  {
    syslog(2, "%s@%d-Channel must be 1 - 4\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_INVALID_CHANNEL_NUMB;
  }

