WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(returnData->timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Couldn't get TimerInfo from timer number:%lu\n",
          __FILE__, __LINE__, returnData->timerNumber);
    return MEADOW_MEAS_FREQ_READ_TIMER_ACCESS_NULL;
  }

  syslog(1, "-->%s@%d-Returning data-for timer:%lu, channel:%lu, active channels:0x%02x\n",
          __FILE__, __LINE__,
          returnData->timerNumber, returnData->channelNumber,
          mdwFreqTimerInfo->chanActiveBits);

  // Is the channel configured?
  uint8_t channelBit = meadow_measure_freq_get_chan_bit_set(
          returnData->channelNumber);
  if((mdwFreqTimerInfo->chanActiveBits & channelBit) == 0)
  {
    syslog(1, "%s@%d-Unconfigured channel accessed\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_CHAN_NOT_CONFIG;
  }

  mdwFreqChanData_t *mdwFreqChanData =
            mdwFreqTimerInfo->mdwFreqChanData[returnData->channelNumber - 1];
  if(mdwFreqChanData == NULL)
  {
    syslog(1, "%s@%d-Channel data NULL\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_CHANNEL_DATA_NULL;
  }

  // Does this timer have any channels?
  if(mdwFreqTimerInfo->chanActiveBits == 0)
  {
    // This should be impossible state
    syslog(1, "%s@%d-No channels active\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_NO_CHANS_ACTIVE;
  }

  // Any activity since last this code was last executed?
  if(mdwFreqChanData->gpioCountForAvg == 0)
  {
    returnData->dutyCycleX1000  = 0;
    returnData->frequencyX1000  = 0;
    returnData->avgFreqX1000    = 0;
    returnData->gpioCountForAvg = 0;

    // Reset capture time for next average
    mdwFreqChanData->startTimeForAvg = meadow_measure_freq_get_current_time();
  
    syslog(1, "%s@%d-No freq input since last check, mdwFreqChanData->gpioCountForAvg == 0\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_NO_INPUT_DETECTED;
  }

  //-------------------------------------------------------
  // We need the timer's width to do the overflow math
  if(mdwFreqTimerInfo->timerWidth)
    regOvrFloTimSize = MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
  else
    regOvrFloTimSize = MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;

  uint64_t ovrFloStartCnt = mdwFreqChanData->bgnResultOvr;

  // Add in the overflow counts
  bgnCapture = mdwFreqChanData->bgnResultCnt + \
        ((mdwFreqChanData->bgnResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  midCapture = mdwFreqChanData->midResultCnt + \
        ((mdwFreqChanData->midResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  endCapture = mdwFreqChanData->endResultCnt + \
        ((mdwFreqChanData->endResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  
  // Normalize from the beginning
  fullCycle = endCapture - bgnCapture;
  halfCycle = midCapture - bgnCapture;

  // To preserve resolution, use floating point math.
  // Duty Cycle is the ratio of the full cycle count and the cycle count
  // before the trailing edge was detected.
  if(mdwFreqChanData->useDutyCycle)
    dblDutyCycle = (((double)halfCycle) * 100.0) / ((double)fullCycle);
  else
    dblDutyCycle = 0;
    
  // The dblFrequency is the timer's clock divided by the cycle count.
  dblFrequency = ((double)MEADOW_FREQ_CLOCK_FREQ) / ((double)fullCycle);

  // Average frequency since last read calculations
  totalCaptureTime = endCaptureTime - mdwFreqChanData->startTimeForAvg;

  // Convert time in nanoseconds to fractional seconds
  double dblTotalCaptureTime = ((double) totalCaptureTime) / (1000.0 * 1000.0 * 1000.0);
  dblTotalInputCount = (double)mdwFreqChanData->gpioCountForAvg;
  dblAvgFreq = ((double)dblTotalInputCount) / dblTotalCaptureTime;

  if(mdwFreqChanData->useDutyCycle)
    returnData->dutyCycleX1000  = (dblDutyCycle * 1000.0);
  else
    returnData->dutyCycleX1000  = 0;

  returnData->frequencyX1000    = (dblFrequency * 1000.0);
  returnData->avgFreqX1000      = (dblAvgFreq   * 1000.0);
  returnData->gpioCountForAvg   = (uint32_t)dblTotalInputCount;

  // Reset capture counts and Meadow time for next average
  mdwFreqChanData->gpioCountForAvg = 0;
  mdwFreqChanData->startTimeForAvg = meadow_measure_freq_get_current_time();

  return MEADOW_MEAS_FREQ_READ_SUCCESSFUL;
}

#if MEADOW_MEASURE_FREQ_INCLUDE_REG_DUMP > 0
//=================================================================
// Dump timer registers for given timer
void meadow_measure_freq_diag_dump_timer_regs(char *label,
          mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  uint32_t timerBase = mdwFreqTimerInfo->timerBase;

  syslog(1, "\nTimer:%lu Register Dump-%s\n", mdwFreqTimerInfo->timerNumb, label);
  syslog(1, "\tCR1:\t0x%08x\tCR2:\t0x%08x\tSMCR:\t0x%08x\tDIER:\t0x%08x\n",
          getreg16(timerBase + STM32_GTIM_CR1_OFFSET),
          getreg16(timerBase + STM32_GTIM_CR2_OFFSET),
          getreg32(timerBase + STM32_GTIM_SMCR_OFFSET),
          getreg16(timerBase + STM32_GTIM_DIER_OFFSET));

  syslog(1, "\tSR:\t0x%08x\tEGR:\t0x%08x\tCCMR1:\t0x%08x\tCCMR2:\t0x%08x\n",
          getreg16(timerBase + STM32_GTIM_SR_OFFSET),
          getreg16(timerBase + STM32_GTIM_EGR_OFFSET),
          getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET),
          getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET));

  syslog(1, "\tCCER:\t0x%08x\tCNT:\t0x%08x\tPSC:\t0x%08x\tARR:\t0x%08x\n",
          getreg16(timerBase + STM32_GTIM_CCER_OFFSET),
          getreg32(timerBase + STM32_GTIM_CNT_OFFSET),
          getreg16(timerBase + STM32_GTIM_PSC_OFFSET),
          getreg32(timerBase + STM32_GTIM_ARR_OFFSET));

  syslog(1, "\tCCR1:\t0x%08x\tCCR2:\t0x%08x\tCCR3:\t0x%08x\tCCR4:\t0x%08x\n",
          getreg32(timerBase + STM32_GTIM_CCR1_OFFSET),
          getreg32(timerBase + STM32_GTIM_CCR2_OFFSET),
          getreg32(timerBase + STM32_GTIM_CCR3_OFFSET),
          getreg32(timerBase + STM32_GTIM_CCR4_OFFSET));

  syslog(1, "\tDCR:\t0x%08x\tDMAR:\t0x%08x\tOR:\t0x%08x\n",
          getreg16(timerBase + STM32_GTIM_DCR_OFFSET),
          getreg16(timerBase + STM32_GTIM_DMAR_OFFSET),
          getreg16(timerBase + STM32_GTIM_OR_OFFSET));
}
#endif
